#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Patrick/patspets_stage/runs/run-KSULDbuukCHuHBvt

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance.aws_instance.main[0] will be created
  + resource "aws_instance" "main" {
      + ami                                  = "ami-0bac6fc47ad07c5f5"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-068080e24bbe10c25"
      + tags                                 = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
      + tags_all                             = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0adf2dfbc99fb3dd8",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2_instance.aws_instance.main[1] will be created
  + resource "aws_instance" "main" {
      + ami                                  = "ami-0bac6fc47ad07c5f5"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-068080e24bbe10c25"
      + tags                                 = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
      + tags_all                             = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0adf2dfbc99fb3dd8",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2_instance.aws_instance.main[2] will be created
  + resource "aws_instance" "main" {
      + ami                                  = "ami-0bac6fc47ad07c5f5"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-068080e24bbe10c25"
      + tags                                 = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
      + tags_all                             = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0adf2dfbc99fb3dd8",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2_instance.tls_private_key.this will be created
  + resource "tls_private_key" "this" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.ec2_instance.module.key_pair.aws_key_pair.this[0] will be created
  + resource "aws_key_pair" "this" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "presto-stage"
      + key_pair_id     = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
      + tags_all        = {
          + "TTL"   = "8"
          + "owner" = "presto"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + my_nodes_public_ips = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_key_pem     = (sensitive value)

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 4 estimated
           $12.528/mo +$12.528

------------------------------------------------------------------------

Organization policy check:

======================== Results for policy set: global ========================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

3 policies evaluated.

## Policy 1: global/aws-restrict-ingress-cidr (soft-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfplan import to validate that no security group  rules have the CIDR "0.0.0.0/0".  It covers both the aws_security_group and  the aws_security_group_rule resources.

./aws-restrict-ingress-cidr.sentinel:163:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 2: global/azure-restrict-ingress-cidr (soft-mandatory)

Result: true

./azure-restrict-ingress-cidr.sentinel:57:1 - Rule "main"
  Value:
    true

./azure-restrict-ingress-cidr.sentinel:49:1 - Rule "block_allow_all"
  Value:
    true

## Policy 3: global/gcp-restrict-ingress-cidr (soft-mandatory)

Result: true

./gcp-restrict-ingress-cidr.sentinel:52:1 - Rule "main"
  Value:
    true

./gcp-restrict-ingress-cidr.sentinel:46:1 - Rule "block_allow_all"
  Value:
    true


========================== Results for policy set: org =========================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

2 policies evaluated.

## Policy 1: org/use-latest-module-version (advisory)

Result: true

Description:
  This policy uses the HTTP import to call the TFC API to get a list of all  modules in a specified module registry and determine their  latest versions. It then uses the tfconfig import to inspect all non-root  modules and validate that those sourced from the registry use the latest  versions.

./use-latest-module-version.sentinel:131:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 2: org/require-all-resources-from-pmr (soft-mandatory)

Result: true

Description:
  This policy validates that all modules loaded directly by the  root module are in the Private Module Registry (PMR) of a TFC  server and that no resources are created in the root module

./require-all-resources-from-pmr.sentinel:56:1 - Rule "main"
  Description:
    Main rule

  Value:
    true


========================= Results for policy set: team =========================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

3 policies evaluated.

## Policy 1: team/enforce-mandatory-tags-aws (soft-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfplan import to require that all EC2 instances  have all mandatory tags.

./enforce-mandatory-tags-aws.sentinel:117:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 2: team/limit-cost-by-workspace-type (soft-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfrun import to restrict the  proposed monthly cost that would be incurred if the current  plan were applied, using different limits for different  workspaces based on their names.

Print messages:

Proposed monthly cost 12.528 of workspace patspets_stage is under the limit: 50

./limit-cost-by-workspace-type.sentinel:66:1 - Rule "main"
  Value:
    true

## Policy 3: team/restrict-instance-type-aws (soft-mandatory)

Result: true

./restrict-instance-type-aws.sentinel:60:1 - Rule "main"
  Description:
    Main rule that requires other rules to be true

  Value:
    true

./restrict-instance-type-aws.sentinel:53:1 - Rule "instance_type_allowed"
  Description:
    Rule to restrict instance types

  Value:
    true


========================= Results for policy set: teams ========================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

2 policies evaluated.

## Policy 1: teams/blacklist-network-resources (soft-mandatory)

Result: true

Description:
  This policy prevents any changes (creation, destruction or updates)  to blacklisted resources.

./blacklist-network-resources.sentinel:77:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 2: teams/require-all-modules-from-pmr (soft-mandatory)

Result: true

Description:
  This policy validates that all modules loaded directly by the  root module are in the Private Module Registry (PMR) of a TFC  server and that no resources are created in the root module

./require-all-modules-from-pmr.sentinel:43:1 - Rule "main"
  Description:
    Main rule

  Value:
    true



```

</details>

*Pusher: @ppresto, Action: `pull_request`*